# Excercise - 1

# US_Baby_Names

## Import the necessary libraries

In [2]:
import pandas as pd

In [36]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')

# See the first 10 entries

In [37]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

# Delete the column 'Unnamed: 0' and 'Id'

In [38]:
baby_names.drop(['Unnamed: 0','Id'], inplace=True, axis = 1)

# del baby_names['Unnamed: 0']

In [39]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

# Are there more male or female names in the dataset?

In [40]:
baby_names.Gender.value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

# Group the dataset by name and assign to names

In [45]:
del baby_names['Year']

In [50]:
names = baby_names.groupby('Name').sum()

names.sort_values('Count', ascending = False).head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

# How many different names exist in the dataset?

In [53]:
len(names)

17632

# What is the name with most occurrences?

In [58]:
names.Count.idxmax()

'Jacob'

# How many different names have the least occurrences?

In [63]:
len(names[names.Count == names.Count.min()])

2578

# What is the median name occurrence?

In [64]:
names[names.Count == names.Count.median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

# What is the standard deviation of names?

In [67]:
round(names.Count.std())

11006

# Get a summary with the mean, min, max, std and quartiles.

In [69]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000